app/views/users/show.html.erb

SELECT  1 AS one FROM "entries" WHERE "entries"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  <section>
    <% if @user.entries.any? %>