app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."sub" = ? LIMIT ?  [["sub", "108664048138407109954"], ["LIMIT", 1]]
INSERT INTO "users" ("given_name", "family_name", "created_at", "updated_at", "sub") VALUES (?, ?, ?, ?, ?)  [["given_name", "Kevin"], ["family_name", "Yang"], ["created_at", "2018-02-01 04:22:58.514650"], ["updated_at", "2018-02-01 04:22:58.514650"], ["sub", "108664048138407109954"]]
---
  def create
    # get parsed and validated id token
    id_token = validate_id_token params[:id_token]
    if !id_token.nil?
      @user = User.find_by sub: id_token['sub']
      if @user.nil?
        # Create new user
        @user = User.new sub: id_token['sub'],
                         given_name: id_token['given_name'],
                         family_name: id_token['family_name']
        unless @user.save